#Makefile
# -o: 출력파일을 지정하는데 사용. 일반적으로 이 옵션은 컴파일된 오브젝트 파일이나 실행 파일의 이름을 지정하는데 사용

# -c: 컴파일 과정에서 오직 컴파일 단계만 실행하고 링크 단계를 수행하지 않도록 하는 옵션.
# 일반적으로 링크 과정은 오브젝트 파일들을 하나로 결합해 실행 파일을 생성하는 과정이다.
# -c 옵션을 사용하면 이런 링크 과정을 생략하고 오직 컴파일 과정만을 수행한다.
# 주로 대규모 프로젝트에서 여러 소스 파일을 컴파일할 때 모든 소스 파일을 각각 개별적으로 컴파일해 오브젝트 파일을 생성할 수 있다.
# 이를 통해 수정된 소스 파일의 변경 사항이 있을 경우 해당 소스 파일만 다시 컴파일 해 파일간의 의존성을 처리할 수 있다.

all: add-nbo

add-nbo: main.o
	g++ main.o -o add-nbo

main.o: main.cpp
	g++ -c main.cpp -o main.o

clean:
	rm -f add-nbo
	rm -f *.o

